### 쇼핑몰의 고객 정보를 기반으로 기계학습을 위한 EDA(전처리)

In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [2]:
plt.rc('font', family='malgun gothic')
plt.rc('axes', unicode_minus=False)

%matplotlib inline

**데이터 로딩**

**mem_data.csv 고객정보데이터**

- 'MEM_ID' : 회원 코드
- 'M_STORE_ID' : 가맹점 코드
- 'GENDER' : 남(M) 여(F)
- 'BIRTH_DT' : 생년월일
- 'BIRTH_SL' : 양력(S), 음력(L)
- 'ZIP_CD' : 우편번호
- 'RGST_DT' : 등록일
- 'VISIT_CNT' : 방문횟수
- 'SALES_AMT' : 구매 합계
- 'LAST_VST_DT' : 최근 방문 일자
- 'USABLE_PNT' : 가용 포인트
- 'USED_PNT' : 사용포인트 합계
- 'ACC_PNT' : '누적 포인트 합계'
- 'USABLE_INIT' : 초기 포인트
- 'SMS' : SMS 수신 동의(Y/N)

<hr>

**store_info.csv**

- STORE_CD : 판매점코드
- STORE_REGION : 판매점지역


<hr>

**mem_transaction.csv**

- STORE_ID : 판매매장 코드
- SELL_DT : 판매 일자
- MEMP_STY : 주문시 생성(O), 추후 적립(M), 웹입력(W)
- MEM_ID : 회원 코드 
- SELL_AMT : 판매 금액
- MEMP_TP : A:적립, U:사용, R:조회

In [3]:
mem_data = pd.read_csv("input/mem_data.csv")
mem_tr = pd.read_csv("input/mem_transaction.csv")
store_info = pd.read_csv("input/store_info.csv")
# mem_data.info()

In [4]:
mem_tr.head()

,STORE_ID,SELL_DT,MEMP_STY,MEM_ID,MEMP_DT,SELL_AMT,MEMP_TP
0,125,20060227,O,1225434,2006-02-27 13:57:44.750000000,15500,A
1,125,20060303,O,1181938,2006-03-03 15:43:56.987000000,22600,A
2,125,20060322,O,6093,2006-03-22 18:08:45.563000000,11000,A
3,125,20060403,O,1398202,2006-04-03 13:36:27.040000000,14400,A
4,125,20060418,O,1225434,2006-04-18 16:04:39.583000000,6600,A

In [5]:
store_info.head()

   STORE_ID  STORE_REGION
0       128             2
1       129             2
2       130            11
3       133            16
4       136            13

In [6]:
mem_data.head()

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS
0,1134945,1084,M,NaN,S,-,2006-02-04 11:51:08.233000000,8.0,337000.0,2007-01-19 21:46:12.827000000,6740.0,0.0,6740.0,3202.0,Y
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233000000,22.0,1438500.0,2007-10-18 19:57:45.503000000,1732.0,12000.0,13732.0,17762.0,Y
2,7009,1113,F,1973-04-06,S,-,2006-02-04 11:51:08.233000000,8.0,309300.0,2007-05-30 15:21:10.863000000,6372.0,0.0,6372.0,1856.0,Y
3,1374842,1300,M,NaN,S,-,2006-02-04 11:51:08.233000000,3.0,110300.0,2007-03-25 12:49:30.170000000,2206.0,0.0,2206.0,1522.0,Y
4,1383660,1024,M,NaN,S,-,2006-02-05 16:56:58,2.0,33500.0,2006-09-09 14:55:21.687000000,670.0,0.0,670.0,110.0,Y

In [7]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS'],
      dtype='object')

In [8]:
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4193 non-null   object
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       7534 non-null   object
 6   RGST_DT      7534 non-null   object
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   object
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
dtypes: float64(6), int64(2), object(7)
memory usage: 883.0+ KB

In [9]:
mem_tr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60049 entries, 0 to 60048
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   STORE_ID  60049 non-null  int64
 1   SELL_DT   60049 non-null  int64
 2   MEMP_STY  60049 non-null  object
 3   MEM_ID    60049 non-null  int64
 4   MEMP_DT   60049 non-null  object
 5   SELL_AMT  60049 non-null  int64
 6   MEMP_TP   60049 non-null  object
dtypes: int64(4), object(3)
memory usage: 3.2+ MB

In [10]:
store_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 329 entries, 0 to 328
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   STORE_ID      329 non-null    int64
 1   STORE_REGION  329 non-null    int64
dtypes: int64(2)
memory usage: 5.3 KB

In [11]:
# 각 컬럼별 데이터 개수 카운트
# 데이터에 - 표기가 많은, 전처리 해결책 : 강제적으로 결측치로 대체 
mem_data.ZIP_CD.value_counts()

-          6585
158-826      14
480-070      11
467-866      11
482-852       8
           ...
631-763       1
420-843       1
421-160       1
405-300       1
482-844       1
Name: ZIP_CD, Length: 624, dtype: int64

In [12]:
mem_data.ZIP_CD

0             -
1       420-721
2             -
3             -
4             -
         ...
7529          -
7530          -
7531          -
7532          -
7533    142-872
Name: ZIP_CD, Length: 7534, dtype: object

In [13]:
mem_data.ZIP_CD == '-'

0        True
1       False
2        True
3        True
4        True
        ...
7529     True
7530     True
7531     True
7532     True
7533    False
Name: ZIP_CD, Length: 7534, dtype: bool

In [14]:
mem_data.loc[mem_data.ZIP_CD == '-']

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS
0,1134945,1084,M,NaN,S,-,2006-02-04 11:51:08.233000000,8.0,337000.0,2007-01-19 21:46:12.827000000,6740.0,0.0,6740.0,3202.0,Y
2,7009,1113,F,1973-04-06,S,-,2006-02-04 11:51:08.233000000,8.0,309300.0,2007-05-30 15:21:10.863000000,6372.0,0.0,6372.0,1856.0,Y
3,1374842,1300,M,NaN,S,-,2006-02-04 11:51:08.233000000,3.0,110300.0,2007-03-25 12:49:30.170000000,2206.0,0.0,2206.0,1522.0,Y
4,1383660,1024,M,NaN,S,-,2006-02-05 16:56:58,2.0,33500.0,2006-09-09 14:55:21.687000000,670.0,0.0,670.0,110.0,Y
5,911717,10792,M,NaN,S,-,2006-02-04 11:51:08.233000000,18.0,227400.0,2007-10-21 17:16:03.257000000,4548.0,0.0,4548.0,842.0,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7528,268317,997,F,1980-02-03,S,-,2006-02-04 11:51:08.233000000,8.0,176200.0,2007-08-09 20:33:59.167000000,1264.0,3000.0,4264.0,1978.0,Y
7529,343892,130,F,1983-04-28,S,-,2006-02-04 11:51:08.233000000,22.0,383300.0,2007-10-28 12:35:20.587000000,7866.0,0.0,7866.0,2884.0,Y
7530,312177,130,F,1981-08-24,S,-,2006-02-04 11:51:08.233000000,18.0,385800.0,2007-11-07 19:22:06.137000000,870.0,7000.0,7870.0,4292.0,Y
7531,454881,1181,M,NaN,S,-,2006-02-04 11:51:08.233000000,3.0,85800.0,2007-04-14 21:13:18.977000000,1716.0,0.0,1716.0,0.0,Y
7532,973807,812,M,NaN,S,-,2006-02-04 11:51:08.233000000,4.0,208200.0,2007-09-12 12:58:43.683000000,4164.0,0.0,4164.0,1110.0,Y

In [15]:
# 데이터 분석을 함에 있어서 우편번호는 - 만으로는 적용 불가 따라서 반드시 대체(단, 고객정보 무를 의미하는 nan값으로 대체)
mem_data.loc[mem_data.ZIP_CD == '-', 'ZIP_CD'] = np.nan

In [16]:
mem_data.ZIP_CD.value_counts()

158-826    14
467-866    11
480-070    11
467-070     8
482-852     8
           ..
134-060     1
142-102     1
420-846     1
480-755     1
630-757     1
Name: ZIP_CD, Length: 623, dtype: int64

In [17]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS'],
      dtype='object')

<hr>

**날짜형 변수 처리**

In [18]:
col = ['BIRTH_DT', 'RGST_DT', 'LAST_VST_DT']
mem_data[col]

        BIRTH_DT                        RGST_DT                    LAST_VST_DT
0            NaN  2006-02-04 11:51:08.233000000  2007-01-19 21:46:12.827000000
1     1973-07-11  2006-02-04 11:51:08.233000000  2007-10-18 19:57:45.503000000
2     1973-04-06  2006-02-04 11:51:08.233000000  2007-05-30 15:21:10.863000000
3            NaN  2006-02-04 11:51:08.233000000  2007-03-25 12:49:30.170000000
4            NaN            2006-02-05 16:56:58  2006-09-09 14:55:21.687000000
...          ...                            ...                            ...
7529  1983-04-28  2006-02-04 11:51:08.233000000  2007-10-28 12:35:20.587000000
7530  1981-08-24  2006-02-04 11:51:08.233000000  2007-11-07 19:22:06.137000000
7531         NaN  2006-02-04 11:51:08.233000000  2007-04-14 21:13:18.977000000
7532         NaN  2006-02-04 11:51:08.233000000  2007-09-12 12:58:43.683000000
7533  1979-12-31  2006-02-04 11:51:08.233000000  2007-02-26 20:59:18.540000000

[7534 rows x 3 columns]

In [19]:
col

['BIRTH_DT', 'RGST_DT', 'LAST_VST_DT']

In [20]:
# 각 시리즈(컬럼)별 row수 만큼 함수 호출 : apply()
# to_datetime() 변환시 Nan값으로 에러 발생  
# 결측치는 그냥 결측치로 하면서 유효 데이터만 날짜 포멧 변경 가능한 옵션 : errors='coerce'
# NaN -> NaT 변경

mem_data[col] = mem_data[col].apply(pd.to_datetime, errors='coerce')

In [21]:
mem_data[col]

       BIRTH_DT                 RGST_DT             LAST_VST_DT
0           NaT 2006-02-04 11:51:08.233 2007-01-19 21:46:12.827
1    1973-07-11 2006-02-04 11:51:08.233 2007-10-18 19:57:45.503
2    1973-04-06 2006-02-04 11:51:08.233 2007-05-30 15:21:10.863
3           NaT 2006-02-04 11:51:08.233 2007-03-25 12:49:30.170
4           NaT 2006-02-05 16:56:58.000 2006-09-09 14:55:21.687
...         ...                     ...                     ...
7529 1983-04-28 2006-02-04 11:51:08.233 2007-10-28 12:35:20.587
7530 1981-08-24 2006-02-04 11:51:08.233 2007-11-07 19:22:06.137
7531        NaT 2006-02-04 11:51:08.233 2007-04-14 21:13:18.977
7532        NaT 2006-02-04 11:51:08.233 2007-09-12 12:58:43.683
7533 1979-12-31 2006-02-04 11:51:08.233 2007-02-26 20:59:18.540

[7534 rows x 3 columns]

In [22]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS'],
      dtype='object')

**나이 컬럼 추가**

In [23]:
mem_data.BIRTH_DT

0             NaT
1      1973-07-11
2      1973-04-06
3             NaT
4             NaT
          ...
7529   1983-04-28
7530   1981-08-24
7531          NaT
7532          NaT
7533   1979-12-31
Name: BIRTH_DT, Length: 7534, dtype: datetime64[ns]

In [24]:
mem_data.BIRTH_DT.describe()

count                    4180
unique                   3248
top       2003-11-03 00:00:00
freq                       90
first     1937-08-12 00:00:00
last      2067-10-24 00:00:00
Name: BIRTH_DT, dtype: object

In [25]:
pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT

0             NaT
1      17705 days
2      17801 days
3             NaT
4             NaT
          ...
7529   14127 days
7530   14739 days
7531          NaT
7532          NaT
7533   15341 days
Name: BIRTH_DT, Length: 7534, dtype: timedelta64[ns]

In [26]:
(pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days

0           NaN
1       17705.0
2       17801.0
3           NaN
4           NaN
         ...
7529    14127.0
7530    14739.0
7531        NaN
7532        NaN
7533    15341.0
Name: BIRTH_DT, Length: 7534, dtype: float64

In [27]:
# 윤년 포함된 연산 결과를 도출하기 위해 날짜에서 / 365가 아닌 365.25 수치값으로 나누라 함
((pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days ) / 365.25

0             NaN
1       48.473648
2       48.736482
3             NaN
4             NaN
          ...
7529    38.677618
7530    40.353183
7531          NaN
7532          NaN
7533    42.001369
Name: BIRTH_DT, Length: 7534, dtype: float64

In [28]:
# float타입 변환은 nan값 허용, int로 변환시도시에 nan값으로 에러 발생
# 정수로 변경전 non값을 수치 0으로 변경후 int로 변환 

#mem_data['AGE'] = (((pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days ) / 365.25).astype('int')

In [29]:
mem_data['AGE'] = ((pd.to_datetime('2021-12-31') - mem_data.BIRTH_DT).dt.days ) / 365.25

In [30]:
mem_data.head()

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,USABLE_PNT,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,6740.0,0.0,6740.0,3202.0,Y,NaN
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,1732.0,12000.0,13732.0,17762.0,Y,48.473648
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,6372.0,0.0,6372.0,1856.0,Y,48.736482
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,2206.0,0.0,2206.0,1522.0,Y,NaN
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,670.0,0.0,670.0,110.0,Y,NaN

In [31]:
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
dtypes: datetime64[ns](3), float64(7), int64(2), object(4)
memory usage: 941.9+ KB

In [32]:
mem_data.BIRTH_DT

0             NaT
1      1973-07-11
2      1973-04-06
3             NaT
4             NaT
          ...
7529   1983-04-28
7530   1981-08-24
7531          NaT
7532          NaT
7533   1979-12-31
Name: BIRTH_DT, Length: 7534, dtype: datetime64[ns]

In [33]:
mem_data.BIRTH_DT.dt.month

0        NaN
1        7.0
2        4.0
3        NaN
4        NaN
        ...
7529     4.0
7530     8.0
7531     NaN
7532     NaN
7533    12.0
Name: BIRTH_DT, Length: 7534, dtype: float64

In [34]:
mem_data.BIRTH_DT.dt.year

0          NaN
1       1973.0
2       1973.0
3          NaN
4          NaN
         ...
7529    1983.0
7530    1981.0
7531       NaN
7532       NaN
7533    1979.0
Name: BIRTH_DT, Length: 7534, dtype: float64

**등록월 추출해서 R_MONTH라는 컬럼 추가**

In [35]:
# 등록일 컬럼 - RGST_DT
mem_data['R_MONTH'] = mem_data.RGST_DT.dt.month

In [36]:
mem_data.R_MONTH

0       2
1       2
2       2
3       2
4       2
       ..
7529    2
7530    2
7531    2
7532    2
7533    2
Name: R_MONTH, Length: 7534, dtype: int64

In [37]:
mem_data.R_MONTH.value_counts()

2     7485
3       32
5        3
4        3
7        2
9        2
1        2
8        2
11       1
6        1
12       1
Name: R_MONTH, dtype: int64

In [38]:
mem_data.R_MONTH

0       2
1       2
2       2
3       2
4       2
       ..
7529    2
7530    2
7531    2
7532    2
7533    2
Name: R_MONTH, Length: 7534, dtype: int64

In [39]:
mem_data.iloc[:, -1]

0       2
1       2
2       2
3       2
4       2
       ..
7529    2
7530    2
7531    2
7532    2
7533    2
Name: R_MONTH, Length: 7534, dtype: int64

In [40]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS', 'AGE', 'R_MONTH'],
      dtype='object')

<hr>

**최근 방문 일자(LAST_VST_DT)로부터 경과일 구하기**

In [41]:
mem_data.LAST_VST_DT

0      2007-01-19 21:46:12.827
1      2007-10-18 19:57:45.503
2      2007-05-30 15:21:10.863
3      2007-03-25 12:49:30.170
4      2006-09-09 14:55:21.687
                 ...
7529   2007-10-28 12:35:20.587
7530   2007-11-07 19:22:06.137
7531   2007-04-14 21:13:18.977
7532   2007-09-12 12:58:43.683
7533   2007-02-26 20:59:18.540
Name: LAST_VST_DT, Length: 7534, dtype: datetime64[ns]

In [42]:
mem_data.shape

(7534, 17)

In [43]:
mem_data.LAST_VST_DT.max()

Timestamp('2007-11-08 21:22:11.797000')

In [44]:
mem_data.LAST_VST_DT.value_counts()

2006-12-29 16:56:54.643    1
2006-08-21 17:49:25.077    1
2007-10-14 13:26:10.663    1
2007-10-06 16:40:24.650    1
2006-06-13 19:37:43.013    1
                          ..
2006-03-06 18:43:31.787    1
2007-01-04 17:09:36.947    1
2006-03-10 20:27:51.627    1
2007-10-26 14:06:41.750    1
2007-06-23 14:55:19.380    1
Name: LAST_VST_DT, Length: 7534, dtype: int64

In [45]:
(pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT)

0      292 days 02:13:47.173000
1       20 days 04:02:14.497000
2      161 days 08:38:49.137000
3      227 days 11:10:29.830000
4      424 days 09:04:38.313000
                 ...
7529    10 days 11:24:39.413000
7530     0 days 04:37:53.863000
7531   207 days 02:46:41.023000
7532    56 days 11:01:16.317000
7533   254 days 03:00:41.460000
Name: LAST_VST_DT, Length: 7534, dtype: timedelta64[ns]

In [46]:
(pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT).dt.days

0       292
1        20
2       161
3       227
4       424
       ...
7529     10
7530      0
7531    207
7532     56
7533    254
Name: LAST_VST_DT, Length: 7534, dtype: int64

In [47]:
mem_data['E_DAY'] = (pd.to_datetime('2007-11-08') - mem_data.LAST_VST_DT).dt.days
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
 16  R_MONTH      7534 non-null   int64
 17  E_DAY        7534 non-null   int64
dtypes: datetime64[ns](3), float64(7), int64(4), object(4)
memory usage: 1.0+ MB

In [48]:
mem_data.ZIP_CD

0           NaN
1       420-721
2           NaN
3           NaN
4           NaN
         ...
7529        NaN
7530        NaN
7531        NaN
7532        NaN
7533    142-872
Name: ZIP_CD, Length: 7534, dtype: object

In [49]:
type(mem_data.ZIP_CD.str)

pandas.core.strings.StringMethods

In [50]:
mem_data.ZIP_CD.str.get(0)

0       NaN
1         4
2       NaN
3       NaN
4       NaN
       ...
7529    NaN
7530    NaN
7531    NaN
7532    NaN
7533      1
Name: ZIP_CD, Length: 7534, dtype: object

In [51]:
mem_data['R_REGION'] = mem_data.ZIP_CD.str.get(0)
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7534 entries, 0 to 7533
Data columns (total 19 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   MEM_ID       7534 non-null   int64
 1   M_STORE_ID   7534 non-null   int64
 2   GENDER       7534 non-null   object
 3   BIRTH_DT     4180 non-null   datetime64[ns]
 4   BIRTH_SL     7534 non-null   object
 5   ZIP_CD       949 non-null    object
 6   RGST_DT      7534 non-null   datetime64[ns]
 7   VISIT_CNT    7534 non-null   float64
 8   SALES_AMT    7534 non-null   float64
 9   LAST_VST_DT  7534 non-null   datetime64[ns]
 10  USABLE_PNT   7534 non-null   float64
 11  USED_PNT     7534 non-null   float64
 12  ACC_PNT      7534 non-null   float64
 13  USABLE_INIT  7534 non-null   float64
 14  SMS          7534 non-null   object
 15  AGE          4180 non-null   float64
 16  R_MONTH      7534 non-null   int64
 17  E_DAY        7534 non-null   int64
 18  R_REGION     949 non-null    object
dtypes: datetime64[ns](3), float64(7), int64(4), object(5)
memory usage: 1.1+ MB

**다른 데이터와 연동하여 파생변수 생성해 보기**

In [52]:
mem_data.columns

Index(['MEM_ID', 'M_STORE_ID', 'GENDER', 'BIRTH_DT', 'BIRTH_SL', 'ZIP_CD',
       'RGST_DT', 'VISIT_CNT', 'SALES_AMT', 'LAST_VST_DT', 'USABLE_PNT',
       'USED_PNT', 'ACC_PNT', 'USABLE_INIT', 'SMS', 'AGE', 'R_MONTH', 'E_DAY',
       'R_REGION'],
      dtype='object')

In [53]:
store_info.columns

Index(['STORE_ID', 'STORE_REGION'], dtype='object')

In [54]:
mem_data.shape

(7534, 19)

In [55]:
store_info.shape

(329, 2)

In [56]:
mem_data.merge(store_info, left_on='M_STORE_ID', right_on='STORE_ID').shape

(799, 21)

In [57]:
mem_data.merge(store_info, left_on='M_STORE_ID', right_on='STORE_ID', how='left').shape

(7534, 21)

In [58]:
store_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 329 entries, 0 to 328
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   STORE_ID      329 non-null    int64
 1   STORE_REGION  329 non-null    int64
dtypes: int64(2)
memory usage: 5.3 KB

In [59]:
mem_data.M_STORE_ID.value_counts()

997     1643
2273     693
130      202
1254     178
1113     174
        ...
2095       1
2103       1
2127       1
126        1
2057       1
Name: M_STORE_ID, Length: 342, dtype: int64

In [60]:
(mem_data.M_STORE_ID == 997).sum()

1643

In [61]:
(store_info.STORE_ID == 997).sum()

0

In [62]:
store_info.STORE_ID.value_counts()

3071     1
3710     1
128      1
129      1
130      1
        ..
3407     1
99980    1
3409     1
3211     1
3072     1
Name: STORE_ID, Length: 329, dtype: int64

In [63]:
mem_data = mem_data.merge(store_info, left_on='M_STORE_ID', right_on='STORE_ID', how='left')
mem_data

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_ID,STORE_REGION
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,0.0,6740.0,3202.0,Y,NaN,2,292,NaN,NaN,NaN
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,12000.0,13732.0,17762.0,Y,48.473648,2,20,4,NaN,NaN
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,0.0,6372.0,1856.0,Y,48.736482,2,161,NaN,NaN,NaN
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,0.0,2206.0,1522.0,Y,NaN,2,227,NaN,NaN,NaN
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,0.0,670.0,110.0,Y,NaN,2,424,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,...,0.0,7866.0,2884.0,Y,38.677618,2,10,NaN,130.0,11.0
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,...,7000.0,7870.0,4292.0,Y,40.353183,2,0,NaN,130.0,11.0
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,...,0.0,1716.0,0.0,Y,NaN,2,207,NaN,NaN,NaN
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,...,0.0,4164.0,1110.0,Y,NaN,2,56,NaN,NaN,NaN
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,...,0.0,4164.0,3368.0,Y,42.001369,2,254,1,NaN,NaN

In [64]:
# 의미없는 가맹정 STORE_ID 삭제(drop)
mem_data = mem_data.drop('STORE_ID', axis='columns')
mem_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7534 entries, 0 to 7533
Data columns (total 20 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   MEM_ID        7534 non-null   int64
 1   M_STORE_ID    7534 non-null   int64
 2   GENDER        7534 non-null   object
 3   BIRTH_DT      4180 non-null   datetime64[ns]
 4   BIRTH_SL      7534 non-null   object
 5   ZIP_CD        949 non-null    object
 6   RGST_DT       7534 non-null   datetime64[ns]
 7   VISIT_CNT     7534 non-null   float64
 8   SALES_AMT     7534 non-null   float64
 9   LAST_VST_DT   7534 non-null   datetime64[ns]
 10  USABLE_PNT    7534 non-null   float64
 11  USED_PNT      7534 non-null   float64
 12  ACC_PNT       7534 non-null   float64
 13  USABLE_INIT   7534 non-null   float64
 14  SMS           7534 non-null   object
 15  AGE           4180 non-null   float64
 16  R_MONTH       7534 non-null   int64
 17  E_DAY         7534 non-null   int64
 18  R_REGION      949 non-null    object
 19  STORE_REGION  799 non-null    float64
dtypes: datetime64[ns](3), float64(8), int64(4), object(5)
memory usage: 1.2+ MB


<hr>

**mem_transaction.csv**

- STORE_ID : 판매매장 코드
- SELL_DT : 판매 일자
- MEMP_STY : 주문시 생성(O), 추후 적립(M), 웹입력(W)
- MEM_ID : 회원 코드 
- SELL_AMT : 판매 금액
- MEMP_TP : A:적립, U:사용, R:조회

**평균 구매액을 고객정보 DataFrame에 추가 : TOTAL_AMT**

In [65]:
mem_tr.shape

(60049, 7)

In [66]:
mem_tr.columns

Index(['STORE_ID', 'SELL_DT', 'MEMP_STY', 'MEM_ID', 'MEMP_DT', 'SELL_AMT',
       'MEMP_TP'],
      dtype='object')

In [67]:
mem_tr.value_counts()

STORE_ID  SELL_DT   MEMP_STY  MEM_ID   MEMP_DT                        SELL_AMT  MEMP_TP
1022001   20071028  O         829771   2007-10-28 17:58:24.093000000  38500     A          1
997       20061108  O         1129661  2006-11-08 18:17:40.777000000  25700     A          1
          20061109  O         455532   2006-11-09 12:05:52.407000000  28900     A          1
                              411466   2006-11-09 19:34:57.217000000  20900     A          1
                              398577   2006-11-09 19:56:40.833000000  5900      A          1
                                                                                          ..
1873      20060410  O         991020   2006-04-10 10:34:23.033000000  34800     A          1
          20060407  O         1089365  2006-04-07 18:29:38.270000000  44400     A          1
                              991297   2006-04-07 18:05:42.287000000  28700     A          1
          20060402  O         1110470  2006-04-02 15:31:21.027000000  11800     A          1
125       20060227  O         1225434  2006-02-27 13:57:44.750000000  15500     A          1
Length: 60049, dtype: int64

In [68]:
mem_tr.groupby('MEM_ID')['SELL_AMT']

In [69]:
# 새로운 나온 편리한 문법 - 생성하고자 하는 시리즈(컬럼) 명시와 로직을 agg parameter로 적용
mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean')

                  TOTAL_AMT
MEM_ID
957             2500.000000
1054           38120.000000
1067            7700.000000
1068            8255.555556
1078            5900.000000
...                     ...
2007042901468   3300.000000
2007061900497   7700.000000
2007062900420   5700.000000
2007090300653  32033.333333
2007090300704  23500.000000

[10764 rows x 1 columns]

In [70]:
# 레벨이 분리되어 있던 컬럼명을 동일한 레벨로 맞춤, reset_index 적용
mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean').reset_index()

              MEM_ID     TOTAL_AMT
0                957   2500.000000
1               1054  38120.000000
2               1067   7700.000000
3               1068   8255.555556
4               1078   5900.000000
...              ...           ...
10759  2007042901468   3300.000000
10760  2007061900497   7700.000000
10761  2007062900420   5700.000000
10762  2007090300653  32033.333333
10763  2007090300704  23500.000000

[10764 rows x 2 columns]

In [71]:
mem_data.MEM_ID

0       1134945
1         38458
2          7009
3       1374842
4       1383660
         ...
7529     343892
7530     312177
7531     454881
7532     973807
7533      47542
Name: MEM_ID, Length: 7534, dtype: int64

In [72]:
mem_data.MEM_ID.max()

2007090300653

In [73]:
v = mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean').reset_index()
type(v)

pandas.core.frame.DataFrame

In [74]:
v.shape

(10764, 2)

In [75]:
v.columns

Index(['MEM_ID', 'TOTAL_AMT'], dtype='object')

In [76]:
v.value_counts()

MEM_ID         TOTAL_AMT
2007090300704  23500.000000    1
561868         10005.882353    1
562831         15663.636364    1
562711         13600.000000    1
562490         15400.000000    1
                              ..
1093990        6500.000000     1
1093967        25475.000000    1
1093926        18972.727273    1
1093890        12475.000000    1
957            2500.000000     1
Length: 10764, dtype: int64

In [77]:
mem_data.MEM_ID.value_counts()

509951     1
1132010    1
904659     1
701908     1
26070      1
          ..
1244349    1
602939     1
969532     1
1409853    1
73732      1
Name: MEM_ID, Length: 7534, dtype: int64

In [79]:
v = mem_tr.groupby('MEM_ID')['SELL_AMT'].agg(TOTAL_AMT='mean').reset_index()
# 어떻게 mem_data에 새로운 시리즈로 merge 해야 하나?

In [88]:
temp = mem_data.merge(v, how='left')

In [89]:
temp

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_REGION,TOTAL_AMT
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,0.0,6740.0,3202.0,Y,NaN,2,292,NaN,NaN,16262.500000
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,12000.0,13732.0,17762.0,Y,48.473648,2,20,4,NaN,25018.181818
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,0.0,6372.0,1856.0,Y,48.736482,2,161,NaN,NaN,22025.000000
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,0.0,2206.0,1522.0,Y,NaN,2,227,NaN,NaN,11400.000000
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,0.0,670.0,110.0,Y,NaN,2,424,NaN,NaN,14000.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,...,0.0,7866.0,2884.0,Y,38.677618,2,10,NaN,11.0,10718.181818
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,...,7000.0,7870.0,4292.0,Y,40.353183,2,0,NaN,11.0,9511.111111
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,...,0.0,1716.0,0.0,Y,NaN,2,207,NaN,NaN,28600.000000
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,...,0.0,4164.0,1110.0,Y,NaN,2,56,NaN,NaN,38175.000000
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,...,0.0,4164.0,3368.0,Y,42.001369,2,254,1,NaN,12933.333333

In [90]:
temp.iloc[:, -1] = temp.iloc[:, -1].fillna(0)

In [91]:
temp

,MEM_ID,M_STORE_ID,GENDER,BIRTH_DT,BIRTH_SL,ZIP_CD,RGST_DT,VISIT_CNT,SALES_AMT,LAST_VST_DT,...,USED_PNT,ACC_PNT,USABLE_INIT,SMS,AGE,R_MONTH,E_DAY,R_REGION,STORE_REGION,TOTAL_AMT
0,1134945,1084,M,NaT,S,NaN,2006-02-04 11:51:08.233,8.0,337000.0,2007-01-19 21:46:12.827,...,0.0,6740.0,3202.0,Y,NaN,2,292,NaN,NaN,16262.500000
1,38458,539,F,1973-07-11,S,420-721,2006-02-04 11:51:08.233,22.0,1438500.0,2007-10-18 19:57:45.503,...,12000.0,13732.0,17762.0,Y,48.473648,2,20,4,NaN,25018.181818
2,7009,1113,F,1973-04-06,S,NaN,2006-02-04 11:51:08.233,8.0,309300.0,2007-05-30 15:21:10.863,...,0.0,6372.0,1856.0,Y,48.736482,2,161,NaN,NaN,22025.000000
3,1374842,1300,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,110300.0,2007-03-25 12:49:30.170,...,0.0,2206.0,1522.0,Y,NaN,2,227,NaN,NaN,11400.000000
4,1383660,1024,M,NaT,S,NaN,2006-02-05 16:56:58.000,2.0,33500.0,2006-09-09 14:55:21.687,...,0.0,670.0,110.0,Y,NaN,2,424,NaN,NaN,14000.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7529,343892,130,F,1983-04-28,S,NaN,2006-02-04 11:51:08.233,22.0,383300.0,2007-10-28 12:35:20.587,...,0.0,7866.0,2884.0,Y,38.677618,2,10,NaN,11.0,10718.181818
7530,312177,130,F,1981-08-24,S,NaN,2006-02-04 11:51:08.233,18.0,385800.0,2007-11-07 19:22:06.137,...,7000.0,7870.0,4292.0,Y,40.353183,2,0,NaN,11.0,9511.111111
7531,454881,1181,M,NaT,S,NaN,2006-02-04 11:51:08.233,3.0,85800.0,2007-04-14 21:13:18.977,...,0.0,1716.0,0.0,Y,NaN,2,207,NaN,NaN,28600.000000
7532,973807,812,M,NaT,S,NaN,2006-02-04 11:51:08.233,4.0,208200.0,2007-09-12 12:58:43.683,...,0.0,4164.0,1110.0,Y,NaN,2,56,NaN,NaN,38175.000000
7533,47542,2273,F,1979-12-31,S,142-872,2006-02-04 11:51:08.233,3.0,208200.0,2007-02-26 20:59:18.540,...,0.0,4164.0,3368.0,Y,42.001369,2,254,1,NaN,12933.333333